### 📖 Terraform Plan (infra/resources/dev) - success
<details>
<summary>Show Plan</summary>

```hcl
  # azurerm_resource_group.poc_cae will be destroyed
  # (because azurerm_resource_group.poc_cae is not in configuration)
  - resource "azurerm_resource_group" "poc_cae" {
      - id         = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-poc-caef-rg-01" -> null
      - location   = "italynorth" -> null
      - name       = "dx-d-itn-poc-caef-rg-01" -> null
      - tags       = {} -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_subnet.apim will be updated in-place
  ~ resource "azurerm_subnet" "apim" {
      ~ address_prefixes                              = [
          ~ "10.51.21.0/24" -> "10.50.1.0/24",
        ]
        id                                            = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/virtualNetworks/dx-d-itn-common-vnet-01/subnets/dx-d-itn-apim-snet-01"
        name                                          = "dx-d-itn-apim-snet-01"
        # (8 unchanged attributes hidden)
    }

  # module.apim.azurerm_private_dns_a_record.apim_azure_api_net will be created
  + resource "azurerm_private_dns_a_record" "apim_azure_api_net" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "dx-d-itn-playground-pg-apim-01"
      + records             = [
          + "10.51.21.4",
        ]
      + resource_group_name = "dx-d-itn-network-rg-01"
      + tags                = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_api_management"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.2.2"
          + "Scope"          = "Dynatrace PoC"
          + "Source"         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }
      + ttl                 = 3600
      + zone_name           = "azure-api.net"
    }

  # module.apim.azurerm_private_dns_a_record.apim_management_azure_api_net will be created
  + resource "azurerm_private_dns_a_record" "apim_management_azure_api_net" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "dx-d-itn-playground-pg-apim-01"
      + records             = [
          + "10.51.21.4",
        ]
      + resource_group_name = "dx-d-itn-network-rg-01"
      + tags                = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_api_management"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.2.2"
          + "Scope"          = "Dynatrace PoC"
          + "Source"         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }
      + ttl                 = 3600
      + zone_name           = "management.azure-api.net"
    }

  # module.apim.azurerm_private_dns_a_record.apim_scm_azure_api_net will be created
  + resource "azurerm_private_dns_a_record" "apim_scm_azure_api_net" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "dx-d-itn-playground-pg-apim-01"
      + records             = [
          + "10.51.21.4",
        ]
      + resource_group_name = "dx-d-itn-network-rg-01"
      + tags                = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_api_management"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.2.2"
          + "Scope"          = "Dynatrace PoC"
          + "Source"         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }
      + ttl                 = 3600
      + zone_name           = "scm.azure-api.net"
    }

  # module.app_service.azurerm_subnet.this[0] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
      ~ address_prefixes                              = [
          ~ "10.51.26.0/24" -> "10.50.6.0/24",
        ]
        id                                            = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/virtualNetworks/dx-d-itn-common-vnet-01/subnets/dx-d-itn-playground-fe-app-snet-01"
        name                                          = "dx-d-itn-playground-fe-app-snet-01"
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.cosmos.azurerm_cosmosdb_account.this will be updated in-place
  ~ resource "azurerm_cosmosdb_account" "this" {
        id                                       = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/dx-d-itn-playground-pg-cosno-01"
        name                                     = "dx-d-itn-playground-pg-cosno-01"
      ~ tags                                     = {
            "BusinessUnit"   = "DevEx"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Dev"
            "ManagementTeam" = "Developer Experience"
            "ModuleName"     = "azure_cosmos_account"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.0" -> "0.3.1"
            "Scope"          = "Dynatrace PoC"
            "Source"         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }
        # (31 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.cosmos.azurerm_private_endpoint.sql[0] will be updated in-place
  ~ resource "azurerm_private_endpoint" "sql" {
        id                            = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.Network/privateEndpoints/dx-d-itn-playground-pg-cosno-pep-01"
        name                          = "dx-d-itn-playground-pg-cosno-pep-01"
      ~ tags                          = {
            "BusinessUnit"   = "DevEx"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Dev"
            "ManagementTeam" = "Developer Experience"
            "ModuleName"     = "azure_cosmos_account"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.0" -> "0.3.1"
            "Scope"          = "Dynatrace PoC"
            "Source"         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_app.azurerm_subnet.this[0] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
      ~ address_prefixes                              = [
          ~ "10.51.25.0/24" -> "10.50.5.0/24",
        ]
        id                                            = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/virtualNetworks/dx-d-itn-common-vnet-01/subnets/dx-d-itn-playground-be-func-snet-01"
        name                                          = "dx-d-itn-playground-be-func-snet-01"
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.function_test_durable.azurerm_subnet.this[0] will be updated in-place
  ~ resource "azurerm_subnet" "this" {
      ~ address_prefixes                              = [
          ~ "10.51.27.0/24" -> "10.50.7.0/24",
        ]
        id                                            = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/virtualNetworks/dx-d-itn-common-vnet-01/subnets/dx-d-itn-playground-df-func-snet-01"
        name                                          = "dx-d-itn-playground-df-func-snet-01"
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.new_webapp_app_service.azurerm_linux_web_app.this will be created
  + resource "azurerm_linux_web_app" "this" {
      + app_settings                                   = {
          + "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG" = "1"
          + "WEBSITE_DNS_SERVER"                              = "168.63.129.16"
          + "WEBSITE_RUN_FROM_PACKAGE"                        = "1"
          + "WEBSITE_SWAP_WARMUP_PING_PATH"                   = "/"
          + "WEBSITE_SWAP_WARMUP_PING_STATUSES"               = "200,204"
          + "WEBSITE_WARMUP_PATH"                             = "/"
        }
      + client_affinity_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Required"
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "italynorth"
      + name                                           = "dx-d-itn-playground-test-fe-app-01"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = false
      + resource_group_name                            = "dx-d-itn-test-rg-01"
      + service_plan_id                                = (known after apply)
      + site_credential                                = (sensitive value)
      + tags                                           = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_app_service"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "2.0.1"
          + "Scope"          = "Dynatrace PoC"
          + "Source"         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }
      + virtual_network_backup_restore_enabled         = false
      + virtual_network_subnet_id                      = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/virtualNetworks/dx-d-itn-common-vnet-01/subnets/dx-d-itn-playground-test-fe-app-snet-01"
      + vnet_image_pull_enabled                        = false
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = 2
          + health_check_path                       = "/"
          + http2_enabled                           = true
          + ip_restriction_default_action           = "Deny"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = true
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + node_version = "22-lts"
            }
        }
    }

  # module.new_webapp_app_service.azurerm_linux_web_app_slot.this[0] will be created
  + resource "azurerm_linux_web_app_slot" "this" {
      + app_metadata                                   = (known after apply)
      + app_service_id                                 = (known after apply)
      + app_settings                                   = {
          + "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG" = "1"
          + "WEBSITE_DNS_SERVER"                              = "168.63.129.16"
          + "WEBSITE_RUN_FROM_PACKAGE"                        = "1"
          + "WEBSITE_SWAP_WARMUP_PING_PATH"                   = "/"
          + "WEBSITE_SWAP_WARMUP_PING_STATUSES"               = "200,204"
          + "WEBSITE_WARMUP_PATH"                             = "/"
        }
      + client_affinity_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Required"
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + name                                           = "staging"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = false
      + site_credential                                = (sensitive value)
      + tags                                           = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_app_service"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "2.0.1"
          + "Scope"          = "Dynatrace PoC"
          + "Source"         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }
      + virtual_network_backup_restore_enabled         = false
      + virtual_network_subnet_id                      = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/virtualNetworks/dx-d-itn-common-vnet-01/subnets/dx-d-itn-playground-test-fe-app-snet-01"
      + vnet_image_pull_enabled                        = false
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = 2
          + health_check_path                       = "/"
          + http2_enabled                           = true
          + ip_restriction_default_action           = "Deny"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = true
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + node_version = "22-lts"
            }
        }
    }

  # module.new_webapp_app_service.azurerm_private_endpoint.app_service_sites will be created
  + resource "azurerm_private_endpoint" "app_service_sites" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "dx-d-itn-playground-test-fe-app-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "dx-d-itn-test-rg-01"
      + subnet_id                = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/virtualNetworks/dx-d-itn-common-vnet-01/subnets/dx-d-itn-pep-snet-01"
      + tags                     = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_app_service"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "2.0.1"
          + "Scope"          = "Dynatrace PoC"
          + "Source"         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dx-d-itn-playground-test-fe-app-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sites",
            ]
        }
    }

  # module.new_webapp_app_service.azurerm_private_endpoint.staging_app_service_sites[0] will be created
  + resource "azurerm_private_endpoint" "staging_app_service_sites" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "dx-d-itn-playground-test-fe-staging-app-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "dx-d-itn-test-rg-01"
      + subnet_id                = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/virtualNetworks/dx-d-itn-common-vnet-01/subnets/dx-d-itn-pep-snet-01"
      + tags                     = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_app_service"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "2.0.1"
          + "Scope"          = "Dynatrace PoC"
          + "Source"         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dx-d-itn-playground-test-fe-staging-app-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sites-staging",
            ]
        }
    }

  # module.new_webapp_app_service.azurerm_service_plan.this[0] will be created
  + resource "azurerm_service_plan" "this" {
      + id                              = (known after apply)
      + kind                            = (known after apply)
      + location                        = "italynorth"
      + maximum_elastic_worker_count    = (known after apply)
      + name                            = "dx-d-itn-playground-test-fe-asp-01"
      + os_type                         = "Linux"
      + per_site_scaling_enabled        = false
      + premium_plan_auto_scale_enabled = false
      + reserved                        = (known after apply)
      + resource_group_name             = "dx-d-itn-test-rg-01"
      + sku_name                        = "P1v3"
      + tags                            = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_app_service"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "2.0.1"
          + "Scope"          = "Dynatrace PoC"
          + "Source"         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }
      + worker_count                    = (known after apply)
      + zone_balancing_enabled          = true
    }

  # module.to_do_api.azurerm_api_management_api_policy.policy will be updated in-place
  ~ resource "azurerm_api_management_api_policy" "policy" {
        id                  = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.ApiManagement/service/dx-d-itn-playground-pg-apim-01/apis/to-do-api"
      ~ xml_content         = <<-EOT
          - <policies>
          - 	<inbound>
          - 		<base />
          - 		<set-backend-service backend-id="to-do-api-azure-function" />
          - 		<!-- Append base-path, if defined, before invoking the backend -->
          - 		<choose>
          - 			<when condition="@(System.String.IsNullOrEmpty("api"))"></when>
          - 			<otherwise>
          - 				<rewrite-uri template="@(System.String.Concat("api/", context.Request.Url.Path))" />
          - 			</otherwise>
          - 		</choose>
          - 		<cors>
          - 			<allowed-origins>
          - 				<origin>*</origin>
          - 			</allowed-origins>
          - 			<allowed-methods>
          - 				<method>*</method>
          - 			</allowed-methods>
          - 			<allowed-headers>
          - 				<header>*</header>
          - 			</allowed-headers>
          - 			<expose-headers>
          - 				<header>*</header>
          - 			</expose-headers>
          - 		</cors>
          - 	</inbound>
          - 	<outbound>
          - 		<base />
          - 	</outbound>
          - 	<backend>
          - 		<base />
          - 	</backend>
          - 	<on-error>
          - 		<base />
          - 	</on-error>
          + <policies>
          +   <inbound>
          +     <base />
          +     <set-backend-service backend-id="to-do-api-azure-function" />
          + 
          +      <!-- Append base-path, if defined, before invoking the backend -->
          +     <choose>
          +       <when condition='@(System.String.IsNullOrEmpty("api"))'>
          +       </when>
          +       <otherwise>
          +         <rewrite-uri template='@(System.String.Concat("api/", context.Request.Url.Path))' />
          +       </otherwise>
          +     </choose>
          + 
          +     <cors>
          +       <allowed-origins>
          +           <origin>*</origin>
          +       </allowed-origins>
          +       <allowed-methods>
          +           <method>*</method>
          +       </allowed-methods>
          +       <allowed-headers>
          +           <header>*</header>
          +       </allowed-headers>
          +       <expose-headers>
          +           <header>*</header>
          +       </expose-headers>
          +     </cors>
          +   </inbound>
          +   <outbound>
          +     <base />
          +   </outbound>
          +   <backend>
          +     <base />
          +   </backend>
          +   <on-error>
          +     <base />
          +   </on-error>
            </policies>
        EOT
        # (3 unchanged attributes hidden)
    }

  # module.to_do_api_v3.azurerm_api_management_api_policy.policy will be updated in-place
  ~ resource "azurerm_api_management_api_policy" "policy" {
        id                  = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.ApiManagement/service/dx-d-itn-playground-pg-apim-01/apis/to-do-api-v3"
      ~ xml_content         = <<-EOT
          - <policies>
          - 	<inbound>
          - 		<base />
          - 		<set-backend-service backend-id="to-do-api-azure-function-v3" />
          - 		<!-- Append base-path, if defined, before invoking the backend -->
          - 		<choose>
          - 			<when condition="@(System.String.IsNullOrEmpty("api"))"></when>
          - 			<otherwise>
          - 				<rewrite-uri template="@(System.String.Concat("api/", context.Request.Url.Path))" />
          - 			</otherwise>
          - 		</choose>
          - 		<cors>
          - 			<allowed-origins>
          - 				<origin>*</origin>
          - 			</allowed-origins>
          - 			<allowed-methods>
          - 				<method>*</method>
          - 			</allowed-methods>
          - 			<allowed-headers>
          - 				<header>*</header>
          - 			</allowed-headers>
          - 			<expose-headers>
          - 				<header>*</header>
          - 			</expose-headers>
          - 		</cors>
          - 	</inbound>
          - 	<outbound>
          - 		<base />
          - 	</outbound>
          - 	<backend>
          - 		<base />
          - 	</backend>
          - 	<on-error>
          - 		<base />
          - 	</on-error>
          + <policies>
          +   <inbound>
          +     <base />
          +     <set-backend-service backend-id="to-do-api-azure-function-v3" />
          + 
          +      <!-- Append base-path, if defined, before invoking the backend -->
          +     <choose>
          +       <when condition='@(System.String.IsNullOrEmpty("api"))'>
          +       </when>
          +       <otherwise>
          +         <rewrite-uri template='@(System.String.Concat("api/", context.Request.Url.Path))' />
          +       </otherwise>
          +     </choose>
          + 
          +     <cors>
          +       <allowed-origins>
          +           <origin>*</origin>
          +       </allowed-origins>
          +       <allowed-methods>
          +           <method>*</method>
          +       </allowed-methods>
          +       <allowed-headers>
          +           <header>*</header>
          +       </allowed-headers>
          +       <expose-headers>
          +           <header>*</header>
          +       </expose-headers>
          +     </cors>
          +   </inbound>
          +   <outbound>
          +     <base />
          +   </outbound>
          +   <backend>
          +     <base />
          +   </backend>
          +   <on-error>
          +     <base />
          +   </on-error>
            </policies>
        EOT
        # (3 unchanged attributes hidden)
    }

Plan: 8 to add, 8 to change, 1 to destroy.

Warning: Argument is deprecated

  with module.apim.azurerm_monitor_diagnostic_setting.apim[0],
  on .terraform/modules/apim/monitor.tf line 33, in resource "azurerm_monitor_diagnostic_setting" "apim":
  33: resource "azurerm_monitor_diagnostic_setting" "apim" {

`metric` has been deprecated in favor of the `enabled_metric` property and
will be removed in v5.0 of the AzureRM provider
```

</details>
